In [3]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
data={
    "ename":["raj","rain","rahim","raja"],
    "type":["regular","adhoc","contract","regular"],
    "dept":["cs","ec","ec","cs"],
    "exp":[2,8,5,10],
    "salary":[10000,20000,5000,15000]
}
df=pd.DataFrame(data)
print(df)

   ename      type dept  exp  salary
0    raj   regular   cs    2   10000
1   rain     adhoc   ec    8   20000
2  rahim  contract   ec    5    5000
3   raja   regular   cs   10   15000

In [8]:

df["qulification"]=["BE","BCA","DIPLOMA","BE"]
df

   ename      type dept  exp  salary qulification Qulification
0    raj   regular   cs    2   10000           BE           BE
1   rain     adhoc   ec    8   20000          BCA          BCA
2  rahim  contract   ec    5    5000      DIPLOMA      DIPLOMA
3   raja   regular   cs   10   15000           BE           BE

In [12]:
df.loc[len(df.index)]=["ravi","adhoc","ec",7,1200,"SSLc","CC"]
df

   ename      type dept  exp  salary qulification Qulification
0    raj   regular   cs    2   10000           BE           BE
1   rain     adhoc   ec    8   20000          BCA          BCA
2  rahim  contract   ec    5    5000      DIPLOMA      DIPLOMA
3   raja   regular   cs   10   15000           BE           BE
4   ravi     adhoc   ec    7    1200         SSLc           CC

In [10]:
import matplotlib.pyplot as plt
import pandas as ps
x=type()
plt.bar()
plt.show()

TypeError: type() takes 1 or 3 arguments

In [15]:
ename=salary.filter(lambda x:x>5000 True.salary)
print(ename)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3228350097.py, line 1)